<?php

return [
    'oblasts' => [
        ['name' => 'Ташкентская область'],
        ['name' => 'Сурхандарьинская область'],
        ['name' => 'Самаркандская область'],
        ['name' => 'Бухарская область'],
        ['name' => 'Хорезмская область'],
        ['name' => 'Ферганская область'],
        ['name' => 'Наманганская область'],
        ['name' => 'Андижанская область'],
        ['name' => 'Джизакская область'],
        ['name' => 'Кашкадарьинская область'],
        ['name' => 'Навоийская область'],
        ['name' => 'Рештская область'],
        ['name' => 'Сырдарьинская область'],
        ['name' => 'Каракалпакстан'],
    ],
    'cities' => [
        ['name' => 'Ташкент', 'oblast_id' => 1],
        ['name' => 'Самарканд', 'oblast_id' => 2],
        ['name' => 'Бухара', 'oblast_id' => 3],
        ['name' => 'Хива', 'oblast_id' => 4],
        ['name' => 'Фергана', 'oblast_id' => 5],
        // Другие города добавьте сюда
    ],
    'districts' => [
        ['name' => 'Шайхонтохур', 'city_id' => 1],
        ['name' => 'Яшнабад', 'city_id' => 1],
        ['name' => 'Алмазар', 'city_id' => 1],
        // Другие районы добавьте сюда
    ],
    'mahallas' => [
        ['name' => 'Чорсу', 'district_id' => 1],
        ['name' => 'Мирзо-Улугбек', 'district_id' => 1],
        ['name' => 'Нарпа', 'district_id' => 1],
        // Другие махалли добавьте сюда
    ]
];
